const fs = require("fs");
module.exports.config = {
	name: "PrinceBot",
    version: "1.0.1",
	hasPermssion: 0,
	credits: "SaGor", 
	description: "no prefix",
	commandCategory: "Prince",
	usages: "HiBot",
    cooldowns: 5, 
};

module.exports.handleEvent = function({ api, event, client, __GLOBAL }) {
	var { threadID, messageID } = event;
	if (event.body.indexOf("ফাউন্ডেশন এর কাজ")==0 || (event.body.indexOf("ফাউন্ডেশনের ধারণা")==0)) {
		var msg = {
				body: "আসসালামু আলাইকুম🥰⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n🥰আত-তাক্বওয়া ফাউন্ডেশন🥰\n 😍 এর কাজ হলো😍\n😘 আমরা বাংলাদেশের যে কোন মসজিদ এবং কি এতিমখানায় আমাদের সামর্থ্য অনুযায়ী প্রয়োজনীয় জিনিস প্রদান করা\n আমরা কিন্তু মাদ্রাসায় পড়ি নি এবং ইসলাম সম্পর্কে আমাদের ধারণা খুবই কম তাই আমাদের সকল ভুল-ভ্রান্তি ক্ষমার চোখে দেখবেন অবশ্যই আমাদেরকে সতর্ক করবেন\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আমরা এখানে যারাই আছি তারা কেউ কারো বাড়ির পাশে নাই সম্পূর্ণ বিশ্বাসের ক্ষেত্রে আমরা এ কাজগুলো করে থাকি\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আমাদের সবার চাকরির কিছু টাকা আমরা আমাদের ফাউন্ডেশনের এক জায়গায় জমা করে রাখি যখন আমাদের বেশি টাকা জমা হয় তখন আমরা খোঁজ নেই কোন এলাকায় মসজিদে এবং কি এতিমখানায় কোন প্রয়োজনীয় জিনিস লাগে কি না\n তখন ওই এলাকার আমাদের সহযোদ্ধাদের সহযোগিতায় প্রয়োজনীয় জিনিসটি আমরা সঠিক জায়গায় দেওয়ার চেষ্টা করি আপনিও চাইলে আমাদের ফাউন্ডেশনে আসতে পারেন ধন্যবাদ\n ⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆",
			} 
			api.sendMessage(msg, threadID, messageID) 
	module.exports.run = function({ api, event, client, __GLOBAL }) {

      }
      
      
